public class Bitoperator {
  public static void main(String[] args) {
    // 1. 先得到2的补码 => 2的原码 00000000 00000000 00000000 00000010
    // 2. 先得到3的补码 => 3的原码 00000000 00000000 00000000 00000011
    // 3. 按位与，因此结果是2
    System.out.println(2 & 3);  


    // 推导
    // 1. 先得到-2的原码  10000000 00000000 00000000 00000010
    // 2. 先得到-2的反码  11111111 11111111 11111111 11111101
    // 3. 先得到-2的补码  11111111 11111111 11111111 11111110
    // 按位取反           00000000 00000000 00000000 00000001
    System.out.println(~-2); //1
  }
}
